{"backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "batch_input_shape": [null, 256, 256, 1], "activation": "relu", "use_bias": true, "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "momentum": 0.99, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "momentum": 0.99, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "filters": 96, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "momentum": 0.99, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "filters": 96, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "momentum": 0.99, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_5", "activity_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_5", "momentum": 0.99, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "units": 256, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "units": 128, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_3", "units": 3, "activation": "softmax", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "trainable": true}}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}