{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "filters": 32, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "name": "conv2d_1", "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "batch_input_shape": [null, 256, 256, 1], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 64, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 96, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 96, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 64, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 256, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 128, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 3, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3", "use_bias": true}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential"}